3591
big
red
dwarvish
shadowy
shadows
handed
proper
sharp
share
ankles
squeaked
decent
jacket
shape
astonished
glint
tra-la-la-lally
given
sadly
growing
something
maddened
tracks
huts
settled
light
hush
bags
even
grim
help
watercourse
jump
long
much
noon
shall
rare
rise
hurt
side
tall
yelping
british
view
wire
shaky
worm
save
crack
years
clinging
got
sneaked
portcullis
says
wearisome
descended
thirty
hunt
leaped
unguarded
hung
thirst
strong
jumped
happens
killed
interest
fireworks
mouse
pine-needles
councillors
lands
remained
stepped
northward
shade
stroke
sank
sang
sand
wrapped
homeward
important
same
casks
eggs
scraps
argument
carefully
rest
aware
finding
sake
difference
get
putting
gem
untouched
blackened
pointed
afloat
spluttering
throttled
delayed
yards
smokes
smoked
strode
rent
first
stricken
impatiently
grasses
safe
hurriedly
mutton
cool
cook
willing
fiddles
comic
enchantment
orcs
mention
hut
keyhole
exchange
further
well-armed
come
dreaming
couldn
eyries
height
doors
guarded
cold
exceedingly
talons
comes
claims
courage
wasted
arrived
forest
mirkwood
occasional
wither
plodded
collect
lend
described
lent
seldom
frightfully
perfect
raft-men
arrival
trapdoors
lamps
used
travel
folded
curled
uninvited
fun
judge
real
sacks
read
fry
william
tookish
fro
gardens
sinking
coat
sweeping
advancing
coal
messengers
landed
listening
movement
noises
spread
shadow
for
drawing
fog
foe
stinging
carry
terrible
sighed
maps
emeralds
fiery
sheltering
explain
fly
wearing
stealing
burning
horses
iii
bowing
wearily
success
alarming
luckily
bullroarer
second
rouse
gathering
buttons
fit
banner
nuts
white
ominous
obliged
realize
spinning
whirl
quietly
angrily
beeches
moreover
few
resolved
strength
remembering
whips
fed
round
snail
walls
tonight
away
clearing
walks
drivers
burglar
dimly
whizzing
fat
far
cared
blowing
sloping
while
burgling
smell
stooped
recompense
flickering
puffed
gravely
trotting
ringing
rough
alter
preparations
melody
channel
kindly
delightedly
fattest
fast
key-hole
fare
bodies
eye
drawn
elf-friend
recovering
thorin
finger
enough
which
horror
eve
wits
countless
with
manners
wish
wise
fall
managed
unpacked
spearmen
pantries
brim
ere
store
marched
deserves
story
regular
companions
level
fair
gasping
fail
kettle
swiftly
surface
departed
making
drank
slide
faster
elbow
wing
wine
wind
preciouss
provided
end
among
bred
wood-elves
wily
wanted
will
wild
precise
risks
inquisitive
elf
forded
pinched
fade
longish
fact
helms
deep-throated
snapped
face
buildings
sooner
mightily
hives
goodness
fierce
walking
practically
scarce
otherwise
tremble
thank
might
chosen
wife
mislaid
threat
middle
racket
longing
wretched
howls
grandson
friends
fancies
shrieking
wealth
state
harps
upwards
wide
plan
infuriate
patches
hiding
crashes
running
pierced
letters
cheering
threshold
stars
stare
rivendell
vanguard
sufficient
dwelling
sworn
various
sword
eat
ear
open
fanned
cross
pines
stand
plenty
stamp
approaching
nowhere
croaked
general
scarlet
forks
died
galloping
setting
sending
didn
pinch
porter
myself
become
waken
fresh
waked
pools
midday
into
scuttled
blunt
desolate
within
plain
wizard
fluttering
smaller
lazy
tune
rotting
hanging
stage
groping
literally
staff
fir-trees
guardian
chuckled
arrows
whipped
dug
due
collecting
bottom
force
belladonna
ancestors
girion
banks
mountain
place
directions
dry
victory
drowned
bottle
presently
late
proverb
last
daring
whom
watched
gazed
keys
don
dog
fountains
beorn
window
shoulder
shaking
splash
wondered
credit
shooting
dangling
tubs
hundreds
forced
land
lakes
impatient
lamp
kinsfolk
apart
dim
die
did
compared
lake
elf-king
under
flight
answering
shower
roaring
showed
edge
spoons
lair
kept
laid
when
flapping
built
belonged
pleasant
flapped
casket
bifur
gather
death
what
bigger
merrymaking
lads
gazing
day
haste
upon
journey
opposite
shutting
miserably
without
lake-men
discussed
south
done
puzzle
arming
weapons
paths
groped
dignity
dwell
noise
keep
languages
doubts
returning
westwards
furry
send
dark-green
shivering
smashed
sound
hasten
patch
startled
praps
pocket-handkerchief
ponies
visiting
cut
cup
warning
dropped
daren
sitting
dared
tale
lad
assistance
cry
bagginses
taller
clap
fortunately
clad
listen
onto
parley
hates
depends
escape
let
description
ablaze
soared
perfectly
unfortunate
audacious
trunks
tree-trunk
house
despair
midnight
hours
moment
waist
mining
snapping
passage
missed
goblin-wars
only
eaten
banners
echo
places
table
gleam
rats
whispered
blocked
travelling
menacing
attacked
liar
coins
meadows
lot
dungeons
horribly
senses
burrahobbit
locked
numbers
brighter
horrible
dungeon
authors-note
tower
shone
boys
loudly
perilous
lowest
chilled
destroyed
feels
flummoxed
flowing
instead
describing
ones
rang
settle
can
bows
original
feasting
bowl
flustered
current
bundles
things
edges
flames
roasted
piles
blanket
once
piled
shriek
longer
marvellous
arrow
longed
both
assault
sprang
rain
raid
hunted
born
bore
louder
reasonable
night
disastrous
rage
raft
cheese
dropping
pity
book
trolls
likely
remember
joined
shouts
shrieked
grim-voiced
greatly
buy
but
forest-road
race
removed
fragments
bolg
bold
gorgeous
honest
accounted
pipe
blighter
worried
roused
disgusted
struggled
boil
afoot
talked
terrified
started
pine
balin
wished
bogs
uproar
seeking
boy
bow
met
rescue
greater
grimly
should
body
asks
eagerly
searched
stowed
little
swim
bywater
cheerful
bundle
keeping
thunderstorm
knees
famous
endless
scorched
party
parts
waterfalls
temper
necklace
bid
twelve
smaug
spout
filled
spots
smash
pick
where
flash
unto
smart
called
explaining
twanged
necromancer
beg
bed
sport
borders
style
fault
swam
calling
trotted
divide
leaning
shudder
green
bay
bat
bar
falling
bag
bad
baa
must
creaked
newly
flame
dwarves
small
appeared
true
courtyard
hobbit
peaks
glimpse
fools
hammers
opening
great
grumbled
clamour
disappear
spoke
everything
savage
ordinary
everywhere
damage
curious
manage
angry
nights
magnificence
trot
elvish
unheard
eldest
helped
axe
apples
trick
earth
addition
handses
shallows
unwrought
galloped
remark
howl
mark
outwards
backwards
report
choose
west
kneeling
poles
hour
ate
meeting
easy
dragon-gold
east
shifted
confusion
seed-cakes
were
shivered
outward
ears
skins
earn
arm
host
tremendous
are
glimpses
scrambling
named
forward
wept
chapter
asking
mended
yourself
sleep
grassy
utterly
prevent
happen
skill
early
went
army
new
spears
arms
hope
any
tree
thrain
hoot
and
exact
hood
corners
better
aloud
remain
well
anger
camps
all
windows
ale
home
trap
hole
hold
thousand
air
s-s-s-s-s
sparks
person
aid
crush
runners
enormous
ago
mistaken
age
aren
necklaces
along
alone
certainly
weep
week
companion
lonely
beater
beaten
dell
handsomely
wrote
pasture
arch
widened
webs
each
conversation
planned
wear
weak
lucky
difficulty
raven
hollow
touch
metal
wedged
spirits
sorts
unnecessary
reeds
upset
aloft
wrong
panting
hastening
deer
deep
sorry
adventure
ropes
commotion
companies
matter
ending
hearing
back-door
cruel
dorwinion
moaned
modern
matches
dear
deal
hate
dead
never
mother
doing
show
frying-pan
tree-trunks
growling
wouldn
traffic
scuttle
darkened
darkness
beasts
sure
finishing
warm
kennel
often
poked
pitch-dark
discover
gladly
ahead
bushes
conspirator
inclined
entered
jelly
sung
escaped
length
snoring
search
barrel
barred
off
portion
scuttling
horse
deeply
about
admit
escaping
swimming
yammering
fills
note
calls
bacon
slipped
entirely
begun
horns
nose
stooping
bofur
brass
sheltered
wagging
proved
grow
nori
cause
chill
chose
child
sick
claws
such
wholesome
thatched
crash
softly
rooms
scratching
squeeze
deeper
picked
animal
dells
hunting
dirty
none
widows
drink
doctored
ori
dwelt
dwarf
cleverness
bumping
elder
ended
brushed
memories
dinner
working
total
our
wasting
instruments
blue
separated
fight
chief
flung
completely
grumpy
remembered
freed
plunged
spoken
living
fellows
own
doorway
grey
grew
lamenting
fastened
topmost
hidden
grubb
guard
asked
halls
elf-lords
unhappy
blow
recover
hullo
fiercely
circle
holding
larger
grab
cooking
funny
distance
exception
losing
sky-blue
goblins
pay
merry
dance
cunning
nobody
stop
armies
breeze
bobbed
naughty
squeaking
yellow
nassty
boughs
bothering
paddled
messenger
always
furrier
leather
heroes
hopeful
marks
reminded
supper-time
meant
midst
tired
mouth
fell
platform
trampled
nasty
wolves
glade
scales
scaled
fields
goods
bridle
feast
behold
fears
eyebrows
advanced
shores
step
downwards
swinging
peace
bedroom
plans
cautiously
steadily
unless
posts
debated
yelled
english
beards
toys
blows
answer
alight
mercy
fuss
colour
swish
fury
ready
burned
hurry
town
risen
terror
cakes
urging
silence
roots
efforts
either
overhanging
flocks
absolutely
laughter
gripped
speaking
slain
slimy
smelt
overcome
point
explosions
knocking
torn
oddments
wisdom
trays
tried
seems
changed
tunic
full
split
blood
tops
enchanted
forgotten
took
torches
crawled
you
drunk
rising
soldiers
under-hill
ssss
told
weave
clover
swift
wider
worst
wrath
captives
several
saved
reckoned
fuel
arrive
tidings
borrowed
blazing
magical
may-time
lighter
applied
creatures
dusted
stayed
glimmer
gates
grass
unexpectedly
nervously
precious
played
toes
slumber
perished
block
notion
sailing
thump
charge
writing
rattled
thumb
account
vanished
whistled
yew
eyes
yet
yes
luggage
rounded
shrill
elves
string
suffer
needed
swooped
peered
pegs
shoulders
heels
becoming
watch-post
discussing
peep
hurrying
surprising
nests
galion
tomorrow
allow
bringing
carven
hardly
caught
grabbed
daresay
dragons
besieged
heartily
burglary
deadly
brings
burglars
peak
painted
haven
explored
threatening
magic
thieves
shining
torch
excellent
disturbed
circled
ceased
slash
upper
hopes
stuff
hoped
himself
croaking
fireside
draggled
feared
study
lone-lands
return
stuck
ways
rings
trees
understanding
ought
still
eastern
aside
brown
lust
enthusiasm
chance
boats
since
published
questions
wave
searching
anywhere
father
orders
elf-host
tread
anyway
unsafe
almost
neatly
dreadfully
clouds
wasn
families
wary
figured
wars
warn
outstretched
warg
ray
armed
removing
runes
wanderer
surprise
football
wandered
eight
dawn
rowers
cleared
thoughts
pleasure
amusing
wand
every
case
cliffs
wall
walk
backward
grumble
broke
stores
very
shouted
wake
suffocated
lurking
laden
dark
dare
lying
wait
jewelled
wail
buried
practical
slashed
strangers
expert
luck
supper
cocked
realm
choked
promise
silvered
precipice
gone
names
thirsty
wade
terrifying
information
dale
hedge
roving
cheerless
empty
goblin
waylaid
gold
coming
snails
roared
narrow
sounded
turns
broad
afternoon
nodded
firelight
waiting
oakenshield
tucked
stabbed
dragon
woodland
learned
stream
blundering
naturally
plunder
doesn
bits
cobwebs
reach
hoods
bite
makes
dominion
walking-stick
goes
jewels
foolish
napping
resting
forests
bird
delivered
realized
disturbing
expect
blindly
larder
poled
won
teeth
marvelling
mountain-side
glummer
bill
tramping
consider
cloud
together
pretty
cloth
taking
tobacco
warned
master
somewhere
close
special
replied
usually
songs
however
onslaught
astonishing
youngest
waters
win
concerning
whenever
who
pressing
fender
thinner
captured
senseless
paused
rush
against
ourselves
breathe
chest
wet
praised
web
lightning
favourite
delight
peeped
exactly
dancing
crouched
excitement
twigs
lifted
way
was
war
rune
respect
corner
standing
smack
mountain-sides
echoes
scratched
considering
spits
rule
sliding
echoed
spite
supposing
stumble
jaws
twice
manner
preparing
bubbling
glowing
front-door
worthy
ruin
bridges
lonesome
hated
move
eyrie
unusual
clock
climbed
saying
explained
attercop
silly
slept
sturdy
family
serious
perched
cloak
most
richly
moaning
painfully
thanks
reckon
smelling
more
splashed
from
honey
cheer
walled
occasionally
anxiously
piece
wildly
moon
presents
mood
blessed
threads
goblets
cheat
draught
understood
eleven
regained
visit
furniture
flagons
altogether
spur
lives
spies
lived
disturbance
cosily
riddling
entrance
outlet
polite
closer
closed
also
nearly
crusted
baggins
warmer
free
depart
depths
desert
desire
hasty
except
sorrow
hurricane
devouring
lighting
tunnelling
rushed
weight
spot
ruled
evil
throw
thror
glasses
received
hills
reason
struggle
especially
alive
rekindled
valleys
screamed
mighty
nearer
lower
crows
ever
crown
quite
praise
forgive
bruises
legend
bruised
breath
generations
coats
hilt
treasure
advise
hill
mixed
breast
tools
foe-hammer
believed
forwards
gracious
undergrowth
streams
crawling
sped
tumbled
dragging
madly
threw
enjoy
devices
high
three
floated
meanwhile
rapid
shows
showing
choice
brought
gathered
forging
shout
warlike
veranda
alas
winding
hide
tattered
everybody
archers
thrust
friendship
thrush
swept
short
shore
kicked
pantry
answers
surely
pleased
homes
tongue
ugly
tumbling
walked
quiet
slowly
pays
promised
shoot
daily
palace
shook
bothered
pardon
whistle
swell
quick
washed
western
holiday
use
gollum
wood-fire
fancy
advice
merely
bargain
throwing
stray
straw
accused
giving
stings
path
past
pass
affair
part
slower
croak
slowed
dreary
faintly
forth
badly
sort
drowsy
sweet
sore
sweep
heavy
nice
swirled
jumping
ancient
hobbits
sunlight
rustled
hailed
anything
perils
shoes
payment
harsh
fallen
soon
heath
largest
fifty
rushing
sons
sweat
song
shock
heart
hundred
good-bye
pale
heard
some
tolkien
prosperous
crackling
other
ugh
fought
change
fainter
heaps
times
invisible
breakfast
loves
chiefly
pair
gnashed
loved
glum
paid
another
idea
largely
profits
pieces
unexpected
overshadowed
useless
soft
spider
besides
april
puzzled
branches
pockets
wound
existence
daylight
necessary
glow
nimble
pack
killing
disagree
pace
sharpest
borrow
hospitality
tongs
would
prowling
straight
withered
stretched
nine
spreading
followed
wooden
heads
unpleasant
creeping
treacherous
two
warriors
rather
mixture
flying
labour
holes
nipped
explore
twined
breaking
warrior
tub
skirts
thought
minutes
guesseses
poking
fires
sheath
popped
try
fruit
idle
delighted
trade
glamdring
broken
track
eagles
taste
glad
attack
nick
stealth
top
too
tom
toe
hatred
straws
threatened
wondering
trimmed
snort
following
thinking
wisps
defend
prison
backs
going
until
flowers
suddenly
snow
agreed
tip
grandmother
bodyguard
enjoyed
cleaned
plates
the
tangled
having
tasks
unknown
result
your
astonishment
unharmed
vast
shares
after
afterwards
ten
shared
stones
tea
accept
oncoming
pushed
accident
thankful
winter
behind
brooded
yore
doorstep
right
silently
private
dismay
feeling
wiser
neither
cracked
trudge
effort
suspicion
ranks
pairs
cave
patted
eggses
reached
tighten
four
foul
cast
tunnel
marshes
falls
belts
snap
snag
care
carc
vain
covered
underground
clashed
form
snuffling
ford
asleep
riddles
cape
pretend
looking
ruffled
cellars
frightened
drove
drinking
foot
fool
diamond
food
below
camp
came
neighbourhood
fond
sun
belongs
calm
call
best
redder
provisions
guards
bert
cake
folk
sss
belly
bells
ruins
uncomfortable
blink
blind
hiss
start
vanishing
knife
nephews
tiny
dreadful
spy
besiegers
knives
bent
dizzy
bend
scowled
son
bowls
time
preciousss
affairs
till
murderers
hastened
echoing
belt
smells
bell
chestnuts
expected
grunted
foes
dodging
those
skin-changer
deeds
eating
again
sky
lullaby
heedless
highest
cousins
fleeting
slapped
passages
six
sit
annoyed
sir
collars
cellar
foam
imprisonment
shy
hollows
distant
gloaming
happy
miserable
bowed
tied
turning
bees
beer
been
opinion
bade
tide
packed
beds
impression
set
loosed
masters
wickedness
watchmen
see
sea
rude
why
jars
bother
houses
crocks
tolls
beat
bear
pulling
doubted
trembled
measure
water-gate
say
saw
sat
uneasy
servants
watchman
sad
stoop
stool
stood
stony
rewarded
recovered
stone
different
rested
outside
number
gifts
shoreward
stole
carrock
getting
argue
out
responsible
starve
amid
everlastingly
chair
rabbit
chain
driven
afraid
flower
refuse
beginning
handing
spent
moved
spend
thus
moving
council
guide
splintered
hauled
perch
persons
magnificent
excuse
run
hurtling
pointing
bitter
please
losst
love
pine-trees
loud
lots
esquire
brother
wealthy
lost
loss
sunset
safely
lose
aching
slipping
row
hinges
lord
speed
trumpets
bears
trembling
loop
look
touched
garden
this
thin
spear
speak
dragon-fire
mantelpiece
shuddered
slow
captain
scramble
stared
thrusting
yells
here
rid
bottles
brink
interrupted
bring
steady
they
lake-town
then
them
worth
give
perish
shapes
barrel-rider
parting
worse
logs
quest
stolen
worry
slip
long-forgotten
dain
that
helm
alert
than
held
ideas
immediately
mound
through
itself
beautiful
claim
piercing
keeps
rat
ran
heir
lock
giants
wicked
waited
yerself
events
wounded
moths
brief
smoking
good
bright
loaf
world
invited
edition
correct
beyond
prove
parties
heed
signs
spiders
proud
desperate
strange
farewells
slung
esteemed
service
fetch
strongholds
before
apparently
heat
hear
heap
heavily
head
north-west
grumbling
north-east
southwards
arguing
whirling
queer
invented
words
gift
snatches
sight
sticking
grocer
embers
became
coffee
particular
branch
editions
misty
mists
narrower
days
want
escort
bites
biter
porch
cattle
bound
thanked
heavier
enemies
dozen
dozed
wobbly
clothes
gloomy
probably
wobble
elrond
duty
polished
whisper
lure
fitted
dust
dusk
ingenious
rows
reward
jostling
gigantic
scarcely
door-step
determined
language
eagle
parlour
yer
flowed
cells
figure
oars
blazed
rose
next
climb
news
skin
rope
dotted
protected
root
room
roof
possessed
dense
politely
properly
eager
ragged
wiped
appear
ridge
bending
poisoned
oaks
ravens
mostly
roll
lasted
ages
gained
swords
rider
kings
faint
cliff
teaching
enemy
amazement
kinds
hands
shouting
pursue
possibly
delivery
children
anyone
possible
now-a-days
stirring
butter
kingdom
rescued
excited
mist
miss
confusticate
flow
desolation
flop
rode
boulders
crossing
fright
laughed
rock
put
dripping
muttered
avoid
rolling
being
flickered
dwalin
wailing
hunger
sneaking
roar
preferred
guesses
packages
road
guessed
mine
mind
mirth
wonder
higher
chairs
reveal
need
dodged
mill
mile
careful
cargoes
unseen
anderson
pot
neck
pop
misery
propped
chains
near
sackville-bagginses
flew
chamber
dying
giddy
rivers
fled
thunder
stabbing
whirring
yours
grievous
valley
ravenhill
convenient
starvation
prepared
legendary
tiring
belong
first-class
admitted
notice
missing
discovery
pie
flat
flap
spluttered
playing
smote
young
comfort
respectable
jolly
awkward
smoke-ring
to-day
shields
shouldn
slender
inner
floor
tricksy
quench
just
someone
weeks
pan
kitchen
stay
goblinses
wizards
nothing
lanterns
smoke
unlikely
groans
because
required
stumbled
mischief
errand
begins
direction
june
cover
throve
maybe
text
afar
crime
charged
lights
bless
owl
fearful
egg-question
blew
cheered
seized
bats
intended
returned
jugs
size
imagine
alarmed
float
merrily
siege
bark
bare
bard
shine
throng
throne
earned
poured
cries
elephants
cried
imprisoned
orc
present
birds
rubbed
usual
tent
pierce
rumour
beastly
telling
bank
elf-fires
quickly
tell
trying
thirteen
one
climbing
watching
creaking
auction
finished
merrier
riding
old
ancestor
disappointed
expecting
abroad
trouble
halted
oin
tight
difficult
opened
sink
sing
dining-room
quicker
twisted
guest
guess
weariness
throat
prosperity
marching
comforting
ladders
really
count
considered
promises
gilded
back
weeping
village
towards
slithered
deserted
clapped
rains
easily
could
clambered
welcome
sign
dazzlingly
sigh
refused
follow
oak
laughing
frown
windy
winds
hair
arkenstone
popping
pillars
hoping
crumbled
staggered
friendly
moria
crescent
moments
spark
bridge
spare
silver
occasions
splendid
friend
easier
fairly
rocky
meantime
rocks
rebuilt
contrived
stockings
dived
nostrils
reasons
voices
fashion
moonlight
passes
points
front
passed
damaged
push
tables
allowance
decided
pure
woods
blinking
whistling
sudden
slaves
yourselves
heights
loose
nieces
caution
music
sides
borne
shield
shut
begin
plight
trapped
lines
gaily
pull
delay
now
not
nor
lingered
barely
nod
traces
slopes
meeting-place
steeply
hissing
dreamed
famished
have
wander
space
laugh
haul
noted
ordered
huger
chuckling
prophecies
wagged
looks
formed
ledge
stamped
quays
dangers
deepest
shot
interruptions
hart
harp
harm
hark
truth
hard
trust
began
drop
hobbit-hole
frowning
northern
glittering
scattered
themselves
shiver
hang
hand
nonsense
sniffed
ends
gets
position
halt
shadowed
hall
silent
sharpened
half
cousin
extent
twinkle
anxious
truly
drip
sharper
crying
ask
bushy
jogged
hail
arranged
breed
relatives
five
drew
noticed
actually
gems
water
lofty
bewildered
shan
hadn
fish
break
spying
bread
fire
stone-giants
watch
heavens
draw
drat
packs
worked
roasting
esgaroth
wherever
catching
southern
giant
curses
hook
gloom
refreshed
cursed
fine
find
suppose
breathing
wakened
softer
slap
imagined
twinkling
sounds
fill
fili
fourteen
file
dragged
horn
weather
island
begged
abominable
granted
birthday-present
purple
across
sometimes
burdens
forgetting
skull
drawing-room
gloin
howling
thumping
struck
treasures
tassel
squash
immensely
suspected
beneath
leaves
noses
scuffling
course
offer
reputation
burst
blankets
simply
offered
waste
bit
later
neighbours
baggages
introduce
approach
picking
globe
carrion
strung
ashore
think
thing
confused
burnt
whispering
drier
leading
dried
know
shaken
men
rumble
knob
muttering
gurgling
ridges
tinder-boxes
cure
everyday
roast
golden
farewell
redoubled
may
mat
tales
map
man
mad
descendant
cannot
sting
remarkable
wrought
thief
adventures
carried
battered
squeezed
knows
beside
known
north
rumbled
spaces
disappeared
boat
knew
pillow
bidding
look-out
answered
professional
guided
hissed
hither
name
butterflies
clear
jogging
bustle
mess
two-handed
mere
evidently
women
stiff
honour
impossible
ruined
overheard
nain
sneezed
torchlight
baggage
scrambled
peering
power
warrant
grows
experience
grown
benches
pondering
live
stick
disturb
else
roads
flashes
above
pocket
flashed
mounted
drenched
rustling
circling
talking
seemed
low
meaning
log
lob
believe
vengeance
supplies
mistake
crowns
elms
renewed
nosing
familiar
doubt
mortal
homely
hooves
hopped
assure
line
younger
venture
huddled
meet
dwellings
hairy
certain
awful
lit
rafts
lie
lid
spells
business
weary
like
knock
warnings
whose
reply
people
pushing
meat
creature
mean
interested
meal
able
mead
useful
storm
fourteenth
leg
breakfasts
serve
led
relieved
between
mines
fellow
crowds
mined
life
moon-letters
lies
hushed
knowing
lids
danger
lay
mince
taken
owed
whole
blaze
wargs
crept
thoroughly
stained
hungry
comforted
cracking
corrections
marauding
grasped
fighting
repay
slope
rate
bag-end
raised
thrown
leave
beggars
felled
everyone
fence
collected
least
blast
boots
partly
stories
learn
shallow
melting
letter
thick
task
autumn
snored
leapt
dazed
perhaps
faded
complete
regions
wednesday
worn
interesting
work
wore
word
doze
creep
goblin-cleaver
expenses
guessing
smooth
shelf
exceeding
blame
passing
tongues
rattling
morsel
down
likes
wood
parted
liked
tame
cream
talk
beginnings
chained
skilled
kicking
take
wolf
large
blimey
listened
woke
adventurous
growth
tail
occasion
dori
sheep
minute
pride
jewel
frightful
kin
sent
prey
price
leads
footsteps
blade
door
floors
cursing
cavern
sailed
towering
black
third
risk
snorted
company
couple
revenge
battle
key
booby
looked
hearts
pray
hearth
paraphernalia
powerful
caverns
ripe
suggested
although
over
ring
mattocks
voice
pocket-handkerchiefs
pinching
undoubtedly
personally
sees
toiled
dogs
seen
seem
seek
curse
seeming
recapture
somewhat
rolled
does
swung
spring
pound
remains
groaned
pitch
swirling
already
clammy
seat
stuffy
prisoners
carved
uncomfortably
message
darted
abreast
plucked
overwhelming
money
floods
today
kindness
ride
bombur
cutting
outer
gleamed
rich
sticky
jug
sticks
pulled
faces
no-legs
safety
genuine
yesterday
steaming
straying
solemn
underneath
memory
cinders
splendour
extraordinarily
pouch
leaping
carrying
brave
joy
barrels
immense
sneeze
smoke-rings
job
ours
closely
vexed
dipped
gruffly
animals
obviously
crushed
trunk
terrific
unmarked
exclaimed
gandalf
growled
questioned
riddle
protection
gaze
trusted
glance
troubles
tails
towers
bones
stacked
side-door
troubled
stopped
recovery
according
whatever
turn
gave
armour
hurling
tunnels
servant
indeed
squirrels
market
yess
miles
hoard
gate
fingers
marked
feathers
wriggling
licking
gasp
turned
fells
bowmen
vapour
knotted
caves
crow
blackness
tugged
southward
bowman
driving
others
forest-gate
yell
game
bumped
rabbits
untidy
gale
happened
shelter
orcrist
visitors
fern
sizes
clever
unawares
gondolin
torch-light
shattered
figures
joke
prisoner
gain
flies
impenetrable
evening
issued
stairs
smiling
chopped
join
ivy
elvenking
despairing
foreboding
its
absurd
uncanny
felt
therefore
bracken
iss
declared
isn
coiled
feather
joyful
cram
specially
plains
year
centre
changes
fifteen
rafters
azog
added
improved
starving
terms
bilbo
agree
ordering
inn
happening
safer
feet
marsh
feel
fluttered
difficulties
mountains
these
smiled
ill
particularly
there
clash
inside
somebody
allowed
country
nearest
fear
discovered
knocked
hauling
leaving
colours
means
stomach
crossly
contentedly
ground
written
meals
tea-time
dagger
seven
lords
noticing
secretly
icy
somehow
their
drear
expedition
dream
suspicious
dread
grateful
murmured
knowledge
steps
secret
pretending
grandfather
wings
bungo
morning
gleaming
letting
flicker
murder
crossed
waistcoat
busy
comfortably
bobbing
wielded
thursday
bush
march
comfortable
waving
beats
ventured
wandering
burn
clang
wonderful
strongly
counted
butler
pour
seeing
beard
beating
mass
value
pots
order
post
dangerous
forgot
bump
steep
iron
steel
question
though
shafts
poser
explanation
many
stronger
dursn
whether
greatest
poor
pool
failed
single
pony
hurried
steam
steal
understand
lest
less
make
hesitated
hoy
how
noisily
hot
fathers
rear
fortress
main
mail
tomnoddy
resist
swollen
midsummer
pearls
sorrows
forget
doubtless
wants
singed
reek
aroused
rock-face
lovely
toast
starting
slanting
hit
his
him
durin
summer
hid
quarrelling
made
crazy
curiously
stirred
douglas
anybody
surprised
river
hey
sack
her
theirs
singing
spurs
legs
troop
fours
king
kind
gently
left
provide
gentle
twilight
kill
kili
sense
troll
hat
has
heather
danced
cost
had
handle
ceiling
found
said
huge
catch
axes
bolder
leap
puffing
lead
thunderbolt
biting
woodmen
dreams
sale
direct
rowed
counsel
boiling
gasped
pocketses
